// для того чтобы связать локальный репозиторий с удаленным вводится команда: git remote add короткое_имя  "ссылка на репозиторий"
// проверьте что ссылка закрепилась за репозиторием командой: git remote -v
// синхронизируйте локальный репозиторий с удаленным командой git push короткое_имя master
// диагностировать возможные ошибки можно с помощью команды git status, git log, git remote -v
// в конце каждой лабораторной с помощью команды git add добавить появившиеся файлы, с помощью команды git commit делать снимок (версию) и с помощью git push синхронизируете с удаленным репозиторием